const weatherMessage = (weatherData) => `
🌍 **شهر**: ${weatherData.name}

🌡 **دمای فعلی**: ${weatherData.temp}°C
🔻 **کمینه دما**: ${weatherData.tempMin}°C
🔺 **بیشینه دما**: ${weatherData.tempMax}°C
💧 **رطوبت**: ${weatherData.humidity}%

🌥 **وضعیت هوا**: ${weatherData.description}
💨 **سرعت باد**: ${weatherData.windSpeed} m/s

🌅 **طلوع آفتاب**: ${weatherData.sunrise}
🌇 **غروب آفتاب**: ${weatherData.sunset}
        `;

const startMessage = `🌤️ به **هوانما** خوش آمدید!  

📍 نام شهر موردنظر خود را ارسال کنید تا اطلاعات دقیق آب‌وهوا را دریافت کنید.  

ℹ️ برای مشاهده راهنمای کامل ربات، از دستور **/help** استفاده کنید.  
`;


const helpMessage = `
🌤 **راهنمای استفاده از ربات هوانما** 🌤

🔹 **دریافت آب‌وهوا**  
📌 ارسال نام شهر به‌صورت پیام:  
➖ کافیست نام یک شهر را ارسال کنید تا اطلاعات آب‌وهوای آن نمایش داده شود.  

📌 استفاده از کامند \`/weather\` در چت خصوصی یا گروه:  
\`/weather Tehran\`  
➖ با این دستور می‌توانید وضعیت آب‌وهوای یک شهر را در گروه ها یافت کنید.  

📌 مشاهده موقعیت شهر روی نقشه:  
➖ پس از دریافت اطلاعات، می‌توانید روی نام شهر کلیک کنید تا موقعیت آن روی نقشه باز شود.  

🔹 **سایر امکانات**  
📌 می‌توانید ربات را به گروه اضافه کنید و با دستور
 \`/weather\` 
  آب‌وهوای شهرها را در گروه بررسی کنید.  
        ` ;

export {weatherMessage, startMessage, helpMessage}